import Game.Metadata


World "Quantus"
Level 3

Title "" -- ""

Introduction
"
どうやらフォルマロソフィストたちは, あなたたちに提示できる別の問題について合意しようとしているようです。
しばらくすると, 二つの陣営がはっきりしてきました。
「偶数」と「奇数」という交互の叫び声が聞こえます。Roboは念のため, 対応する定義を先に示しています：

```
def Even (n : ℕ) : Prop := ∃ r, n = r + r
```

彼が`Odd`について話そうとする前に, 
どこからともなく群衆の中から次の紙切れが現れました：
"

Statement : Even 42 := by
  Hint "
    **Robo**: 待って！そのためには定義すら必要ないよ！

    **あなた**: これはどういうわけか自明だな…

    **Robo**: 覚えてる？`decide`は, 真偽を決定する簡単なアルゴリズムがある問題ならすべて解けるんだ。
    具体的な数についての命題は大抵このカテゴリに入るよ！
  "
  decide

Conclusion
"
**あなた**: `decide`は他に何ができるの？

**Robo**: 具体的には, 誰かが`Even 42`が真か偽かを決定する方法について
実行可能なアルゴリズムを指定しました。`decide`がそのようなアルゴリズムを知っていれば, 
問題を解決できるわけです。
"

OnlyTactic decide
