import Game.Metadata

World "Implis"
Level 1

Title "Intro"

Introduction
"
**オペレーションマネージャー**: 例えば, ここを見てください:
"

Statement (A B : Prop) (hB : B) : A → (A ∧ B) := by
  Hint "
      **オペレーションマネージャー**: 作業員たちはこれが正しく, 私たちが緊急に必要としていると言っています. しかし誰も証明できません. 

    **あなた**: ちょっと待ってください. これはまさに含意(`\\to`)ですね. `{B}`が成り立つと仮定し, `{A}`が`{A}かつ{B}`を意味することを示したいのです. はい, もちろん! 確かに正しいです. 

    オペレーションマネージャーは期待の眼差しであなたを見つめています. 

    **あなた** *(Roboに小声で)*: `tauto`と書いてあげましょうか? 

    **Robo** *(小声で返答)*: 彼の様子を見ると, それも理解できないでしょう. 証明を丁寧に書いてあげた方がいいです. 

    **あなた**: でもどうやって? まず『では, `{A}`が成り立つと仮定しましょう...』と言いたいのですが. 

    **Robo**: はい, 良い考えです. 仮定に`h`のような名前を付けて, `intro h`と書いてください. 
    "
  intro hA
  Hint "
      **あなた**: わかりました. これで`{A}`と`{B}`の両方が仮定としてあり, `{A} ∧ {B}`を示す必要があります. 

    **Robo**: その通りです. どうすればいいかはもうわかっていますね. 
    "
  constructor
  assumption
  assumption

Conclusion
"
**オペレーションマネージャー**: 完璧です! ありがとう! 

彼は制御盤に行き, いくつかのボタンを押します. どこかで大きな音とともにベルトコンベアが動き始めます. 

**オペレーションマネージャー**: もう少し時間がありますか? 
"


NewDefinition Arrow
NewTactic intro
DisabledTactic tauto
