import Game.Metadata

World "Ciao"
Level 1

Title "Weiter gehts …"

Introduction ""

Statement : ∀ (n : ℕ), ∃ (m : ℕ), m > n := by
  intro n
  use n+1
  linarith

Conclusion "**あなた**: それほど難しくなかったね…誰が送ったんだろう？なぜ？

**Robo**: きっとリサからのメッセージだ…

Roboは遠くを見つめる. 

**Robo**: 私たちに飛び続けるよう励ましたかったんだと思う

**あなた**: でもどこへ？

**Robo**: あ, 見て, またメッセージが来てる：

*親愛なる地球の皆様*

*お会いできて光栄でした！
皆様が私たちのフォルマロ宇宙に迷い込み, 帰れなくなってしまったことを心からお詫び申し上げます. 
しかし良い知らせがあります：
皆様だけではありません！
急いでズリップ惑星へ向かってください. 
そこにはフォルマロ宇宙に迷い込んだ多くの地球人がいます. 
ズリップは広いです, きっと新しい家が見つかるでしょう. こちらが座標です：*

[248-4804-180 | 844-1001-553](https://leanprover.zulipchat.com/#narrow/channel/113489-new-members/)

*心よりのご挨拶を*

*— フォルマロ哲学者一同*

**Robo**: じゃあ—行こう！

[驚かないで：座標に従うと, 宇宙船は光速を超えて加速し, 一時的にサーバーとの接続が切れます. 
でも大丈夫. きっとズリップに到着できます. ]
"
